app/views/swits/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."swit_id" = ?  [["swit_id", 14]]
---

<%= link_to pluralize(swit.comments.count.to_s, "Comment"), new_swit_comment_path(swit)  %>