app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."swit_id" = ?  [["swit_id", 23]]
SELECT "swits".* FROM "swits"
---
	def new

    	@comment = @swit.comments.new
    	@comments = @swit.comments.all
    	@swits = Swit.all

SELECT "comments".* FROM "comments" WHERE "comments"."swit_id" = ?  [["swit_id", 14]]
---
  	def index
    	@comments = @swit.comments.all

SELECT "comments".* FROM "comments" WHERE "comments"."swit_id" = ? AND "comments"."id" = ? LIMIT 1  [["swit_id", 14], ["id", "1"]]
---
	  def show

	  	@comment = @swit.comments.find(params[:id])

SELECT "swits".* FROM "swits" WHERE "swits"."id" = ? LIMIT 1  [["id", "15"]]
---
	  def edit

	  	@swit = Swit.find(params[:swit_id])

SELECT "swits".* FROM "swits"
INSERT INTO "comments" ("created_at", "swit_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Apr 2014 07:54:52 UTC +00:00], ["swit_id", 14], ["updated_at", Mon, 28 Apr 2014 07:54:52 UTC +00:00]]
---
	def create

	@comment = @swit.comments.new(comments_params)
	@swits = Swit.all
	@comment.user_id= current_user.username
	    respond_to do |format|
	      if @comment.save

SELECT "swits".* FROM "swits" WHERE "swits"."id" = ? LIMIT 1  [["id", "27"]]
---
  def load_swit
		 @swit = Swit.find(params[:swit_id])

SELECT "comments".* FROM "comments" WHERE "comments"."swit_id" = ? AND "comments"."id" = ? LIMIT 1  [["swit_id", 27], ["id", "31"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 31]]
---
  def destroy
    @comment = @swit.comments.find(params[:id])
     @comment.destroy