app/controllers/swits_controller.rb

SELECT "swits".* FROM "swits" ORDER BY "swits"."created_at" DESC
---
  def index
    @swits = Swit.all

INSERT INTO "swits" ("created_at", "post", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Apr 2014 06:18:04 UTC +00:00], ["post", "asa\r\n"], ["updated_at", Mon, 28 Apr 2014 06:18:04 UTC +00:00], ["user_id", "tinjoyvillaruel"]]
---
  def create
    @swit = Swit.new(swit_params)
    @swit.user_id= current_user.username
    respond_to do |format|
      if @swit.save

UPDATE "swits" SET "post" = ?, "updated_at" = ? WHERE "swits"."id" = 3  [["post", "neeeeeeeafdsfs"], ["updated_at", Fri, 25 Apr 2014 09:31:58 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @swit.update(swit_params)

DELETE FROM "swits" WHERE "swits"."id" = ?  [["id", 3]]
---
  def destroy
    @swit.destroy

SELECT "swits".* FROM "swits" WHERE "swits"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_swit
      @swit = Swit.find(params[:id])